**1페이지**

- 제목(AI를 이용하여 시간,거리,경사 선택을 통한 러닝 경로 추천을 받고 싶어하는 사용자들을 위한 맞춤형 추천 앱 개발)

**2페이지**

- 한 줄 요약(발표내용 포괄하게)

**3페이지**

- 현재 사용자들이 겪는 문제를 구체적으로 정의
- ex) 기존의 러닝 앱들은 단순히 기록용으로 쓰이는 경우가 많았음
- ex) 집 주변에 산책로나 공원이 없는 경우 러닝 코스를 직접 짜야하는 번거로움 존재

**4페이지**

- 이 앱의 주요 페르소나 설정
- ex) 색다른 길로 러닝을 하고 싶은 사람
- ex) 일상에서 러닝을 즐기면서 자신만의 최적화된 경로를 찾고싶은 사람
- ex) 출발지에서 원하는 거리만큼 달려서 도착지로 가고싶은 사람
- 페르소나가 겪는 문제점과 불편함?

**5페이지**

- 해결방안!
- 사용자의 피드백을 분석해 더 나은 경로를 추천

**6페이지**

- 사용할 기술 설명?!
- graphhopper API 기술을 이용한 경로 추천과 피드백 시스템

**7페이지**

- graphhopper로 출발지와 도착지를 설정했을때 경로를 보여주는것 시연

**8페이지**

- 인터페이스나 서비스 흐름을 이미지로 표현
- ex)사용자의 입력→경로 추천→피드백 반영→개선된 경로 추천
- 혁신성 강조

**9페이지**

- 향후 작업 계획 소개
- 어떤 기술을 개발할 계획인지 구체적으로

**10페이지**

- 요약 및 결론, 발전가능성 소개

**11페이지**

- Q&A
